apps/traffic_events/data/files.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope
  xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP:Body>
    <d2LogicalModel
      xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <exchange>
        <supplierIdentification>
          <country>nl</country>
          <nationalIdentifier>NLNDW</nationalIdentifier>
        </supplierIdentification>
        <subscription>
          <operatingMode>operatingMode2</operatingMode>
          <subscriptionStartTime>2016-12-21T13:31:24.628Z</subscriptionStartTime>
          <subscriptionState>active</subscriptionState>
          <updateMethod>snapshot</updateMethod>
          <target>
            <address>/172.21.21.40:57714</address>
            <protocol>HTTP</protocol>
          </target>
        </subscription>
      </exchange>
      <payloadPublication
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="nl">
        <publicationTime>2017-01-02T16:28:12.867Z</publicationTime>
        <publicationCreator>
          <country>nl</country>
          <nationalIdentifier>NLNDW</nationalIdentifier>
        </publicationCreator>
        <situation id="NLRWS_NLSIT002083688" version="1">
          <overallSeverity>lowest</overallSeverity>
          <situationVersionTime>2017-01-02T16:28:12Z</situationVersionTime>
          <headerInformation>
            <confidentiality>noRestriction</confidentiality>
            <informationStatus>real</informationStatus>
          </headerInformation>
          <situationRecord xsi:type="RoadOrCarriagewayOrLaneManagement" id="NLRWS_NLSIT002083688_1" version="1">
            <situationRecordCreationTime>2017-01-02T16:28:00Z</situationRecordCreationTime>
            <situationRecordVersionTime>2017-01-02T16:28:11Z</situationRecordVersionTime>
            <probabilityOfOccurrence>certain</probabilityOfOccurrence>
            <source>
              <sourceName>
                <values>
                  <value lang="nl">NLRWS</value>
                </values>
              </sourceName>
            </source>
            <validity>
              <validityStatus>definedByValidityTimeSpec</validityStatus>
              <validityTimeSpecification>
                <overallStartTime>2017-01-02T16:26:00Z</overallStartTime>
                <overallEndTime>2017-01-03T16:28:00Z</overallEndTime>
                <validPeriod>
                  <startOfPeriod>2017-01-02T16:26:00Z</startOfPeriod>
                  <endOfPeriod>2017-01-03T16:28:00Z</endOfPeriod>
                </validPeriod>
              </validityTimeSpecification>
            </validity>
            <cause xsi:type="NonManagedCause">
              <causeDescription>
                <values>
                  <value lang="nl">Ongeval(len)</value>
                </values>
              </causeDescription>
              <causeType>accident</causeType>
            </cause>
            <groupOfLocations xsi:type="Linear">
              <locationForDisplay>
                <latitude>51.98133</latitude>
                <longitude>5.978122</longitude>
              </locationForDisplay>
              <supplementaryPositionalDescription>
                <affectedCarriagewayAndLanes>
                  <carriageway>mainCarriageway</carriageway>
                  <lane>rightLane</lane>
                </affectedCarriagewayAndLanes>
              </supplementaryPositionalDescription>
              <alertCLinear xsi:type="AlertCMethod4Linear">
                <alertCLocationCountryCode>8</alertCLocationCountryCode>
                <alertCLocationTableNumber>5.12</alertCLocationTableNumber>
                <alertCLocationTableVersion>A</alertCLocationTableVersion>
                <alertCDirection>
                  <alertCDirectionCoded>positive</alertCDirectionCoded>
                </alertCDirection>
                <alertCMethod4PrimaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8880</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>200</offsetDistance>
                  </offsetDistance>
                </alertCMethod4PrimaryPointLocation>
                <alertCMethod4SecondaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8879</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>900</offsetDistance>
                  </offsetDistance>
                </alertCMethod4SecondaryPointLocation>
              </alertCLinear>
              <linearExtension>
                <linearByCoordinatesExtension>
                  <linearCoordinatesStartPoint>
                    <pointCoordinates>
                      <latitude>51.98133</latitude>
                      <longitude>5.978122</longitude>
                    </pointCoordinates>
                  </linearCoordinatesStartPoint>
                  <linearCoordinatesEndPoint>
                    <pointCoordinates>
                      <latitude>51.976383</latitude>
                      <longitude>5.9632664</longitude>
                    </pointCoordinates>
                  </linearCoordinatesEndPoint>
                </linearByCoordinatesExtension>
              </linearExtension>
            </groupOfLocations>
            <operatorActionStatus>implemented</operatorActionStatus>
            <complianceOption>mandatory</complianceOption>
            <roadOrCarriagewayOrLaneManagementType>laneClosures</roadOrCarriagewayOrLaneManagementType>
          </situationRecord>
        </situation>
        <situation id="NLRWS_NLSIT002083685" version="2">
          <overallSeverity>lowest</overallSeverity>
          <situationVersionTime>2017-01-02T15:53:22Z</situationVersionTime>
          <headerInformation>
            <confidentiality>noRestriction</confidentiality>
            <informationStatus>real</informationStatus>
          </headerInformation>
          <situationRecord xsi:type="WeatherRelatedRoadConditions" id="NLRWS_NLSIT002083685_1" version="2">
            <situationRecordCreationTime>2017-01-02T15:43:00Z</situationRecordCreationTime>
            <situationRecordVersionTime>2017-01-02T15:53:21Z</situationRecordVersionTime>
            <probabilityOfOccurrence>certain</probabilityOfOccurrence>
            <source>
              <sourceName>
                <values>
                  <value lang="nl">NLRWS</value>
                </values>
              </sourceName>
            </source>
            <validity>
              <validityStatus>definedByValidityTimeSpec</validityStatus>
              <validityTimeSpecification>
                <overallStartTime>2017-01-02T15:42:00Z</overallStartTime>
                <overallEndTime>2017-01-03T15:53:00Z</overallEndTime>
                <validPeriod>
                  <startOfPeriod>2017-01-02T15:42:00Z</startOfPeriod>
                  <endOfPeriod>2017-01-03T15:53:00Z</endOfPeriod>
                </validPeriod>
              </validityTimeSpecification>
            </validity>
            <cause xsi:type="NonManagedCause">
              <causeDescription>
                <values>
                  <value lang="nl">Bevriezing van natte weggedeelten</value>
                </values>
              </causeDescription>
              <causeType>frost</causeType>
            </cause>
            <groupOfLocations xsi:type="Area">
              <locationForDisplay>
                <latitude>51.209297</latitude>
                <longitude>5.9339175</longitude>
              </locationForDisplay>
              <alertCArea>
                <alertCLocationCountryCode>8</alertCLocationCountryCode>
                <alertCLocationTableNumber>5.12</alertCLocationTableNumber>
                <alertCLocationTableVersion>A</alertCLocationTableVersion>
                <areaLocation>
                  <specificLocation>206</specificLocation>
                </areaLocation>
              </alertCArea>
            </groupOfLocations>
            <situationRecordExtension>
              <situationRecordExtendedApproved>
                <safetyRelatedMessage>true</safetyRelatedMessage>
              </situationRecordExtendedApproved>
            </situationRecordExtension>
            <weatherRelatedRoadConditionType>slipperyRoad</weatherRelatedRoadConditionType>
          </situationRecord>
        </situation>
        <situation id="NLRWS_NLSIT002083687" version="1">
          <overallSeverity>lowest</overallSeverity>
          <situationVersionTime>2017-01-02T16:26:27Z</situationVersionTime>
          <headerInformation>
            <confidentiality>noRestriction</confidentiality>
            <informationStatus>real</informationStatus>
          </headerInformation>
          <situationRecord xsi:type="AbnormalTraffic" id="NLRWS_NLSIT002083687_1" version="1">
            <situationRecordCreationTime>2017-01-02T16:26:00Z</situationRecordCreationTime>
            <situationRecordVersionTime>2017-01-02T16:26:26Z</situationRecordVersionTime>
            <probabilityOfOccurrence>certain</probabilityOfOccurrence>
            <source>
              <sourceName>
                <values>
                  <value lang="nl">NLRWS</value>
                </values>
              </sourceName>
            </source>
            <validity>
              <validityStatus>definedByValidityTimeSpec</validityStatus>
              <validityTimeSpecification>
                <overallStartTime>2017-01-02T16:26:00Z</overallStartTime>
                <overallEndTime>2017-01-03T16:24:00Z</overallEndTime>
                <validPeriod>
                  <startOfPeriod>2017-01-02T16:26:00Z</startOfPeriod>
                  <endOfPeriod>2017-01-03T16:24:00Z</endOfPeriod>
                </validPeriod>
              </validityTimeSpecification>
            </validity>
            <groupOfLocations xsi:type="Linear">
              <locationForDisplay>
                <latitude>51.98133</latitude>
                <longitude>5.978122</longitude>
              </locationForDisplay>
              <alertCLinear xsi:type="AlertCMethod4Linear">
                <alertCLocationCountryCode>8</alertCLocationCountryCode>
                <alertCLocationTableNumber>5.12</alertCLocationTableNumber>
                <alertCLocationTableVersion>A</alertCLocationTableVersion>
                <alertCDirection>
                  <alertCDirectionCoded>positive</alertCDirectionCoded>
                </alertCDirection>
                <alertCMethod4PrimaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8880</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>200</offsetDistance>
                  </offsetDistance>
                </alertCMethod4PrimaryPointLocation>
                <alertCMethod4SecondaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8874</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>1700</offsetDistance>
                  </offsetDistance>
                </alertCMethod4SecondaryPointLocation>
              </alertCLinear>
              <linearExtension>
                <linearByCoordinatesExtension>
                  <linearCoordinatesStartPoint>
                    <pointCoordinates>
                      <latitude>51.98133</latitude>
                      <longitude>5.978122</longitude>
                    </pointCoordinates>
                  </linearCoordinatesStartPoint>
                  <linearCoordinatesEndPoint>
                    <pointCoordinates>
                      <latitude>51.95636</latitude>
                      <longitude>5.9293747</longitude>
                    </pointCoordinates>
                  </linearCoordinatesEndPoint>
                </linearByCoordinatesExtension>
              </linearExtension>
            </groupOfLocations>
            <abnormalTrafficType>stationaryTraffic</abnormalTrafficType>
            <queueLength>2000</queueLength>
          </situationRecord>
        </situation>
        <situation id="NLRWS_NLSIT002083683" version="8">
          <overallSeverity>lowest</overallSeverity>
          <situationVersionTime>2017-01-02T16:05:39Z</situationVersionTime>
          <headerInformation>
            <confidentiality>noRestriction</confidentiality>
            <informationStatus>real</informationStatus>
          </headerInformation>
          <situationRecord xsi:type="AbnormalTraffic" id="NLRWS_NLSIT002083683_1" version="8">
            <situationRecordCreationTime>2017-01-02T15:22:00Z</situationRecordCreationTime>
            <situationRecordVersionTime>2017-01-02T16:05:38Z</situationRecordVersionTime>
            <probabilityOfOccurrence>certain</probabilityOfOccurrence>
            <source>
              <sourceName>
                <values>
                  <value lang="nl">NLRWS</value>
                </values>
              </sourceName>
            </source>
            <validity>
              <validityStatus>definedByValidityTimeSpec</validityStatus>
              <validityTimeSpecification>
                <overallStartTime>2017-01-02T15:22:00Z</overallStartTime>
                <overallEndTime>2017-01-03T16:04:00Z</overallEndTime>
                <validPeriod>
                  <startOfPeriod>2017-01-02T15:22:00Z</startOfPeriod>
                  <endOfPeriod>2017-01-03T16:04:00Z</endOfPeriod>
                </validPeriod>
              </validityTimeSpecification>
            </validity>
            <cause xsi:type="NonManagedCause">
              <causeDescription>
                <values>
                  <value lang="nl">Spoedreparatie</value>
                </values>
              </causeDescription>
              <causeType>other</causeType>
            </cause>
            <groupOfLocations xsi:type="Linear">
              <locationForDisplay>
                <latitude>51.950294</latitude>
                <longitude>4.5285945</longitude>
              </locationForDisplay>
              <alertCLinear xsi:type="AlertCMethod4Linear">
                <alertCLocationCountryCode>8</alertCLocationCountryCode>
                <alertCLocationTableNumber>5.12</alertCLocationTableNumber>
                <alertCLocationTableVersion>A</alertCLocationTableVersion>
                <alertCDirection>
                  <alertCDirectionCoded>negative</alertCDirectionCoded>
                </alertCDirection>
                <alertCMethod4PrimaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8101</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>1800</offsetDistance>
                  </offsetDistance>
                </alertCMethod4PrimaryPointLocation>
                <alertCMethod4SecondaryPointLocation>
                  <alertCLocation>
                    <specificLocation>8108</specificLocation>
                  </alertCLocation>
                  <offsetDistance>
                    <offsetDistance>1800</offsetDistance>
                  </offsetDistance>
                </alertCMethod4SecondaryPointLocation>
              </alertCLinear>
              <linearExtension>
                <linearByCoordinatesExtension>
                  <linearCoordinatesStartPoint>
                    <pointCoordinates>
                      <latitude>51.950294</latitude>
                      <longitude>4.5285945</longitude>
                    </pointCoordinates>
                  </linearCoordinatesStartPoint>
                  <linearCoordinatesEndPoint>
                    <pointCoordinates>
                      <latitude>51.98055</latitude>
                      <longitude>4.619476</longitude>
                    </pointCoordinates>
                  </linearCoordinatesEndPoint>
                </linearByCoordinatesExtension>
              </linearExtension>
            </groupOfLocations>
            <abnormalTrafficType>stationaryTraffic</abnormalTrafficType>
            <queueLength>4000</queueLength>
          </situationRecord>
        </situation>
      </payloadPublication>
    </d2LogicalModel>
  </SOAP:Body>
</SOAP:Envelope>